app/views/dynamic_pages/gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  <p> <%= @a_gossip.created_at %> </p>
  <p> <%= link_to (@a_gossip.user.first_name), profile_path(@a_gossip.user.first_name)%> </p>