app/views/dynamic_pages/profile.html.erb

    <p> Email address : <%= @author.email %></p>
    <p> City : <%= City.find(@author.city_id).name %> <%= City.find(@author.city_id).zip_code %> </p>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]