app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
        <hr>
        <h5>Auteur: <%= link_to (@gossip.user.first_name), profile_path(@gossip.user.first_name)%> </h5>
        <h5> City: <%= link_to (City.find(@gossip.user.city_id).name), city_path(City.find(@gossip.user.city_id).name)%> - <%= City.find(@gossip.user.city_id).zip_code %> </h5>