app/views/landing_page/index.html.erb

SELECT "gossips".* FROM "gossips"
---
  <div class="row">
    <% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
          <p class="card-text"><%= gossip.content %></p>
          <%= link_to (gossip.user.first_name), profile_path(gossip.user.first_name), class: "btn btn-primary mr-1"%>