app/controllers/dynamic_pages_controller.rb

  def gossip
    puts "$$****************************************************"
    puts params[:gossip]
    @a_gossip = Gossip.find_by(title: params[:gossip])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."title" = $1 LIMIT $2  [["title", "meh"], ["LIMIT", 1]]