app/controllers/dynamic_pages_controller.rb

  def profile
    puts "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    puts name = params[:profile]
    p @author = User.all.where(first_name: name)
    p User.find(@author.id)
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Fredericka"], ["LIMIT", 11]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Boris"], ["LIMIT", 1]]