app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "julien"], ["content", "machine"], ["user_id", 60], ["created_at", "2020-08-04 14:01:37.230803"], ["updated_at", "2020-08-04 14:01:37.230803"]]
---
  def create
    @gossip = Gossip.new(title: params[:gossip_title], content: params[:gossip_content], user: User.last)
    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "YOLOLILOL"], ["content", "yolilol."], ["updated_at", "2020-08-05 09:55:47.276360"], ["id", 58]]
---
  def update

    @gossip = Gossip.find(params[:id])
    @gossip.update(post_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 71]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy