app/controllers/gossips_controller.rb

  def show
    @a_gossip = Gossip.find_by(title: params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."title" = $1 LIMIT $2  [["title", "julien"], ["LIMIT", 1]]