app/controllers/gossip_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."title" = $1 LIMIT $2  [["title", "keffiyeh"], ["LIMIT", 1]]
---
    def show
        @a_gossip = Gossip.find_by(title: params[:id])