app/controllers/profiles_controller.rb

  def show
    p params[:id]
    @author = User.find_by(first_name: params[:id])
    @author_city = {name: City.find(@author.city_id).name, zip_code: City.find(@author.city_id).zip_code, id: City.find(@author.city_id)}
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Hong"], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]