app/views/cities/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 16]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 13]]
---
    <h3>Gossip publiés dans cette ville</h3>
      <% @city.users.each do |user| %>
        <% user.gossips.each do |gossip|%>